package com.jjb.acl.facility.enums.bus;

/**
 * @Description: 申请状态
 * @author JYData-R&D-Big Star
 * @date 2016年9月7日 下午2:58:26
 * @version V1.0
 */
public enum RtfState {

	/**申请录入*/
	A05("申请录入","申请录入修改"),
	/**录入完成*/
	A10("录入完成","申请录入"),
	/**录入无效删除*/
	A20("录入无效删除","申请录入修改"),
	/**重审完成到人工核查*/
	A25("重审完成到人工核查","重审完成到人工核查"),
	/**重审完成到初审调查*/
	A30("重审完成到初审调查","重审完成到初审调查"),
	/**重审完成到电调*/
	A35("重审完成到电调","重审完成到电调"),
	/**重审完成到终审*/
	A40("重审完成到终审","重审完成到终审"),
	
	/**申请复核*/
	B05("申请复核","录入复核"),
	/**申请复核完成*/
	B10("申请复核完成","录入复核"),
	/**申请复核退回*/
	B15("申请复核退回","录入复核"),
	
	/**待预审*/
	B16("待预审","线上进件"),
	/**预审通过*/
	B20("预审通过","线上进件"),

	/**待归档*/
	B25("待归档","归档"),
	/**归档通过*/
	B26("归档通过","归档"),
	/**归档拒绝*/
	B27("归档拒绝","归档"),
	/**归档退回预审*/
	B28("归档退回预审","归档"),

	/**申请资料验证完成*/
	C05("申请资料验证完成","申请完整性验证"),
	/**重复申请判定通过*/
	D05("重复申请判定通过","申请有效性检查"),
	/**重复申请判定拒绝*/
	D10("重复申请判定拒绝","申请有效性检查"),
	/**申请欺诈检查完成*/
	E05("申请欺诈检查完成","申请反欺诈"),
	
	/**人行征信完成*/
	E10("人行征信完成","联网核查"),
	/**已发起人行查询*/
	E11("已发起人行查询","联网核查"),
	/**已发起人行查询*/
	E20("等待人行超时","联网核查"),
	
	/**人工核查结束*/
	E12("人工核查","人工核查"),
	/**人工核查结束*/
	E14("人工核查完成","人工核查"),
	/**人工核查退回*/
	E15("人工核查退回","人工核查"),
	
	/**征信查询审批失败*/
	E25("征信查询审批失败","征信查询审批"),
	/**自动决策通过*/
	E26("征信查询审批通过","征信查询审批"),
	/**自动决策退回*/
	E27("征信查询审批退回","征信查询审批"),
	
	/**初审至决策*/
	F01("初审至决策","初审调查"),
	/**初审退回至人工核查*/
	F02("初审退回至人工核查","初审调查"),
	/**初审退回至预审*/
	F03("初审退回至预审","初审调查"),
	/**初审调查*/
	F05("初审调查","初审调查"),
	/**初审调查拒绝*/
	F06("初审调查拒绝","初审调查"),
	/**初审调查退回录入修改*/
	F07("初审调查退回录入修改","初审调查"),
	/**初审调查要求补件*/
	F08("初审调查要求补件","初审调查"),
	/**初审调查原因拒绝*/
	F09("初审调查原因拒绝","初审调查"),
	/**初审调查完成*/
	F10("初审调查完成","初审调查"),
	/**初审调查退回电调*/
	F11("初审调查退回电调","初审调查"),
	/**免电话调查*/
	F21("免电话调查","初审调查"),
	
	/**电话调查*/
	F15("电话调查","电话调查"),
	/**电话调查拒绝*/
	F16("电话调查拒绝","电话调查"),
	/**电话调查退回初审*/
	F18("电话调查退回初审","电话调查"),
	/**电话调查退回录入修改*/
	F19("电话调查退回录入修改","电话调查"),
	/**电话调查完成*/
	F20("电话调查完成","电话调查"),
	/**电话调查原因拒绝*/
	F29("电话调查原因拒绝","电话调查"),
	
	/**(人工)欺诈调查完成*/
	F30("欺诈调查完成","欺诈调查完成"),
	
	/**发送补件短信*/
	G03("发送补件短信","补件发送短信"),
	/**补件操作*/
	G05("补件操作","补件操作"),
	/**补件完成*/
	G10("补件完成","补件操作"),
	/**补件超时*/
	G15("补件人工超时","补件操作"),
	/**补件超时*/
	G16("补件自动超时","补件操作"),
	
	/**自动初审判定通过*/
	H05("自动初审判定通过","自动初审判定"),
	/**自动初审判定拒绝*/
	H10("自动初审判定拒绝","自动初审判定"),
	/**评分完成*/
	I05("评分完成","评分"),
	/**系统授信额度计算完成*/
	J05("系统授信额度计算完成","授信额度计算"),
	
	/**终审*/
	K05("终审","终审"),
	/**终审退回至电调*/
	K08("终审退回至电调","终审"),
	/**终审退回至初审*/
	K18("终审退回至初审","终审"),
	/**终审完成*/
	K10("终审完成","终审"),
	/**终审拒绝*/
	K15("终审拒绝","终审"),	
	
	/**成功申请*/
	L05("成功申请","成功申请"),
	/**失败申请*/
	M05("失败申请","失败申请"),
	/**生成申请文件*/
	N05("生成申请文件","生成申请文件"),
	/**等待制卡*/
	O05("等待制卡","等待制卡"),
	/**制卡中*/
	P05("制卡中","制卡中"),
	/**制卡验证失败*/
	Q05("制卡验证失败","制卡验证失败"),
	
	/**自动审批完成*/
	H15("自动审批完成","风险决策"),
	/**自动决策至人工反欺诈*/
	H16("自动审批谨慎审批","风险决策"),
	/**"自动审批拒绝*/
	H17("自动审批拒绝","风险决策"),
	/**自动审批成功*/
	H18("自动审批成功","风险决策"),
	
	/**外部决策至人工审批*/
	H20("外部决策至人工审批","外部风险决策"),
	/**外部决策成功*/
	H21("外部决策成功","外部风险决策"),
	/**外部决策失败*/
	H22("外部决策失败","外部风险决策"),
	
	/**推送审批拒绝结论*/
	H25("推送审批拒绝结论","系统推送"),
	/**推送审批通过结论*/
	H26("推送审批通过结论","系统推送");


	public String state;
	public String lab;
	public String taskName;

	private RtfState(String lab,String taskName) {
		this.state = name();
		this.lab = lab;
		this.taskName = taskName;
	}

}
